# Practical Exam: House sales

RealAgents is a real estate company that focuses on selling houses.

RealAgents sells a variety of types of house in one metropolitan area.

Some houses sell slowly and sometimes require lowering the price in order to find a buyer.

In order to stay competitive, RealAgents would like to optimize the listing prices of the houses it is trying to sell.

They want to do this by predicting the sale price of a house given its characteristics.

If they can predict the sale price in advance, they can decrease the time to sale.


## Data

The dataset contains records of previous houses sold in the area.

| Column Name | Criteria                                                |
|-------------|---------------------------------------------------------|
| house_id    | Nominal. </br> Unique identifier for houses. </br>Missing values not possible. |
| city        | Nominal. </br>The city in which the house is located. One of 'Silvertown', 'Riverford', 'Teasdale' and 'Poppleton'. </br>Replace missing values with "Unknown". |
| sale_price  | Discrete. </br>The sale price of the house in whole dollars. Values can be any positive number greater than or equal to zero.</br>Remove missing entries. |
| sale_date   | Discrete. </br>The date of the last sale of the house. </br>Replace missing values with 2023-01-01. |
| months_listed  | Continuous. </br>The number of months the house was listed on the market prior to its last sale, rounded to one decimal place. </br>Replace missing values with mean number of months listed, to one decimal place. |
| bedrooms    | Discrete. </br>The number of bedrooms in the house. Any positive values greater than or equal to zero. </br>Replace missing values with the mean number of bedrooms, rounded to the nearest integer. |
| house_type   | Ordinal. </br>One of "Terraced" (two shared walls), "Semi-detached" (one shared wall), or "Detached" (no shared walls). </br>Replace missing values with the most common house type. |
| area      | Continuous. </br>The area of the house in square meters, rounded to one decimal place. </br>Replace missing values with the mean, to one decimal place. |

# Task 1

The team at RealAgents knows that the city that a property is located in makes a difference to the sale price. 

Unfortuntately they believe that this isn't always recorded in the data. 

Calculate the number of missing values of the `city`. 

 - You should use the data in the file "house_sales.csv". 

 - Your output should be an object `missing_city`, that contains the number of missing values in this column.

In [355]:
import pandas as pd

In [356]:
house_sales = pd.read_csv(r"house_sales.csv")
house_sales.head()

,house_id,city,sale_price,sale_date,months_listed,bedrooms,house_type,area
0,1217792,Silvertown,55943,2021-09-12,5.4,2,Semi-detached,107.8 sq.m.
1,1900913,Silvertown,384677,2021-01-17,6.3,5,Detached,498.8 sq.m.
2,1174927,Riverford,281707,2021-11-10,6.9,6,Detached,542.5 sq.m.
3,1773666,Silvertown,373251,2020-04-13,6.1,6,Det.,528.4 sq.m.
4,1258487,Silvertown,328885,2020-09-24,8.7,5,Detached,477.1 sq.m.

In [357]:
house_sales['city'].value_counts(dropna=False)

city
Silvertown    517
Teasdale      366
Poppleton     362
Riverford     182
--             73
Name: count, dtype: int64

In [358]:
# so the number missing values is the same as the number of '--'
missing_city = 73

# Task 2 

Before you fit any models, you will need to make sure the data is clean. 

The table below shows what the data should look like. 

Create a cleaned version of the dataframe. 

 - You should start with the data in the file "house_sales.csv". 

 - Your output should be a dataframe named `clean_data`. 

 - All column names and values should match the table below.


| Column Name | Criteria                                                |
|-------------|---------------------------------------------------------|
| house_id    | Nominal. </br> Unique identifier for houses. </br>Missing values not possible. |
| city        | Nominal. </br>The city in which the house is located. One of 'Silvertown', 'Riverford', 'Teasdale' and 'Poppleton' </br>Replace missing values with "Unknown". |
| sale_price  | Discrete. </br>The sale price of the house in whole dollars. Values can be any positive number greater than or equal to zero.</br>Remove missing entries. |
| sale_date   | Discrete. </br>The date of the last sale of the house. </br>Replace missing values with 2023-01-01. |
| months_listed  | Continuous. </br>The number of months the house was listed on the market prior to its last sale, rounded to one decimal place. </br>Replace missing values with mean number of months listed, to one decimal place. |
| bedrooms    | Discrete. </br>The number of bedrooms in the house. Any positive values greater than or equal to zero. </br>Replace missing values with the mean number of bedrooms, rounded to the nearest integer. |
| house_type   | Ordinal. </br>One of "Terraced", "Semi-detached", or "Detached". </br>Replace missing values with the most common house type. |
| area      | Continuous. </br>The area of the house in square meters, rounded to one decimal place. </br>Replace missing values with the mean, to one decimal place. |

In [359]:
clean_data = house_sales.copy()

In [360]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   house_id       1500 non-null   int64
 1   city           1500 non-null   object
 2   sale_price     1500 non-null   int64
 3   sale_date      1500 non-null   object
 4   months_listed  1469 non-null   float64
 5   bedrooms       1500 non-null   int64
 6   house_type     1500 non-null   object
 7   area           1500 non-null   object
dtypes: float64(1), int64(3), object(4)
memory usage: 93.9+ KB

In [361]:
clean_data['city'].fillna('Unknown', inplace=True)
clean_data['city'] = clean_data['city'].replace('--', 'Unknown')

C:\Users\moham\AppData\Local\Temp\ipykernel_8204\250484835.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  clean_data['city'].fillna('Unknown', inplace=True)

In [362]:
clean_data.dropna(subset=['sale_price'], inplace=True)

In [363]:
clean_data[clean_data['sale_price'] < 0]

Empty DataFrame
Columns: [house_id, city, sale_price, sale_date, months_listed, bedrooms, house_type, area]
Index: []

In [364]:
clean_data['sale_date'].fillna('2023-01-01', inplace=True)

C:\Users\moham\AppData\Local\Temp\ipykernel_8204\3936878161.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  clean_data['sale_date'].fillna('2023-01-01', inplace=True)

In [365]:
clean_data['months_listed'].fillna(round(clean_data['months_listed'].mean(), 1), inplace=True)

C:\Users\moham\AppData\Local\Temp\ipykernel_8204\100869716.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  clean_data['months_listed'].fillna(round(clean_data['months_listed'].mean(), 1), inplace=True)

In [366]:
clean_data[clean_data['months_listed'] < 0]

Empty DataFrame
Columns: [house_id, city, sale_price, sale_date, months_listed, bedrooms, house_type, area]
Index: []

In [367]:
clean_data['bedrooms'].fillna(round(clean_data['bedrooms'].mean()), inplace=True)

C:\Users\moham\AppData\Local\Temp\ipykernel_8204\204666329.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  clean_data['bedrooms'].fillna(round(clean_data['bedrooms'].mean()), inplace=True)

In [368]:
clean_data[clean_data['bedrooms'] < 0]

Empty DataFrame
Columns: [house_id, city, sale_price, sale_date, months_listed, bedrooms, house_type, area]
Index: []

In [369]:
clean_data['house_type'].unique()

array(['Semi-detached', 'Detached', 'Det.', 'Terraced', 'Semi', 'Terr.'],
      dtype=object)

In [370]:
clean_data['house_type'].replace({'Det.': 'Detached', 'Semi': 'Semi-detached', 'Terr.': 'Terraced'}, inplace=True)

C:\Users\moham\AppData\Local\Temp\ipykernel_8204\2343624923.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  clean_data['house_type'].replace({'Det.': 'Detached', 'Semi': 'Semi-detached', 'Terr.': 'Terraced'}, inplace=True)

In [371]:
house_types = ['Semi-detached', 'Detached', 'Terraced']
house_type_mode = clean_data['house_type'].mode()[0]
clean_data['house_type'] = clean_data['house_type'].apply(lambda x: house_type_mode if x not in house_types else x)

In [372]:
clean_data['area']
# Series.replace() for replacing the whole string, but Series.sre.replace() is for replacing substrings
clean_data['area'] = clean_data['area'].str.replace(' sq.m.', '')
clean_data['area'] = clean_data['area'].astype('float').round(1)

In [373]:
clean_data['area'].fillna(round(clean_data['area'].mean(), 1), inplace=True)

C:\Users\moham\AppData\Local\Temp\ipykernel_8204\3082973083.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  clean_data['area'].fillna(round(clean_data['area'].mean(), 1), inplace=True)

In [374]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   house_id       1500 non-null   int64
 1   city           1500 non-null   object
 2   sale_price     1500 non-null   int64
 3   sale_date      1500 non-null   object
 4   months_listed  1500 non-null   float64
 5   bedrooms       1500 non-null   int64
 6   house_type     1500 non-null   object
 7   area           1500 non-null   float64
dtypes: float64(2), int64(3), object(3)
memory usage: 93.9+ KB

# Task 3 

The team at RealAgents have told you that they have always believed that the number of bedrooms is the biggest driver of house price. 

Producing a table showing the difference in the average sale price by number of bedrooms along with the variance to investigate this question for the team.

 - You should start with the data in the file 'house_sales.csv'.

 - Your output should be a data frame named `price_by_rooms`. 

 - It should include the three columns `bedrooms`, `avg_price`, `var_price`. 

 - Your answers should be rounded to 1 decimal place.

In [375]:
price_by_rooms = house_sales.groupby('bedrooms', as_index=False).agg(
    avg_price = ('sale_price', 'mean'),
    var_price = ('sale_price', 'var')
).round({'avg_price' : 1, 'var_price' : 1})

price_by_rooms
# if you print(price_by_rooms['var_price'][0]), you will notice that it's rounded to only one decimal place

   bedrooms  avg_price     var_price
0         2    67076.4  5.652896e+08
1         3   154665.1  2.378289e+09
2         4   234704.6  1.725211e+09
3         5   301515.9  2.484328e+09
4         6   375741.3  3.924432e+09

# Task 4

Fit a baseline model to predict the sale price of a house.

 1. Fit your model using the data contained in “train.csv” </br></br>

 2. Use “validation.csv” to predict new values based on your model. You must return a dataframe named `base_result`, that includes `house_id` and `price`. The price column must be your predicted values.

In [376]:
from sklearn.ensemble import RandomForestRegressor
from sklearn.preprocessing import StandardScaler

In [377]:
train = pd.read_csv('train.csv')
train.head()

,house_id,city,sale_price,sale_date,months_listed,bedrooms,house_type,area
0,1634561,Teasdale,401869,2021-12-14,7.0,6,Detached,519.7
1,1009770,Silvertown,372387,2022-09-11,8.1,6,Detached,507.8
2,1946667,Silvertown,325473,2020-08-19,5.4,5,Detached,466.8
3,1798290,Silvertown,349469,2022-12-10,6.4,5,Detached,499.4
4,1533461,Poppleton,199995,2020-04-07,4.3,4,Detached,335.0

In [378]:
train_hotencoded = pd.get_dummies(data=train, columns=['city', 'bedrooms', 'house_type'])
train_hotencoded.head()

,house_id,sale_price,sale_date,months_listed,area,city_Poppleton,city_Riverford,city_Silvertown,city_Teasdale,bedrooms_2,bedrooms_3,bedrooms_4,bedrooms_5,bedrooms_6,house_type_Detached,house_type_Semi-detached,house_type_Terraced
0,1634561,401869,2021-12-14,7.0,519.7,False,False,False,True,False,False,False,False,True,True,False,False
1,1009770,372387,2022-09-11,8.1,507.8,False,False,True,False,False,False,False,False,True,True,False,False
2,1946667,325473,2020-08-19,5.4,466.8,False,False,True,False,False,False,False,True,False,True,False,False
3,1798290,349469,2022-12-10,6.4,499.4,False,False,True,False,False,False,False,True,False,True,False,False
4,1533461,199995,2020-04-07,4.3,335.0,True,False,False,False,False,False,True,False,False,True,False,False

In [379]:
X_train = train_hotencoded.drop(columns=['house_id', 'sale_price', 'sale_date'])
y_train = train_hotencoded['sale_price']

In [380]:
std_scalar = StandardScaler()
X_train_scaled = std_scalar.fit_transform(X_train)

In [381]:
validation = pd.read_csv('validation.csv')
validation.head()

,house_id,city,sale_date,months_listed,bedrooms,house_type,area
0,1331375,Teasdale,2022-05-17,7.7,3,Terraced,209.7
1,1630115,Teasdale,2020-06-30,6.5,4,Detached,390.6
2,1645745,Silvertown,2020-09-02,7.4,6,Detached,556.8
3,1336775,Silvertown,2021-10-03,8.8,3,Semi-detached,208.3
4,1888274,Silvertown,2022-06-13,5.7,4,Detached,389.2

In [382]:
validation_hotencoded = pd.get_dummies(data=validation, columns=['city', 'bedrooms', 'house_type'])
validation_hotencoded.head()

,house_id,sale_date,months_listed,area,city_Poppleton,city_Riverford,city_Silvertown,city_Teasdale,bedrooms_2,bedrooms_3,bedrooms_4,bedrooms_5,bedrooms_6,house_type_Detached,house_type_Semi-detached,house_type_Terraced
0,1331375,2022-05-17,7.7,209.7,False,False,False,True,False,True,False,False,False,False,False,True
1,1630115,2020-06-30,6.5,390.6,False,False,False,True,False,False,True,False,False,True,False,False
2,1645745,2020-09-02,7.4,556.8,False,False,True,False,False,False,False,False,True,True,False,False
3,1336775,2021-10-03,8.8,208.3,False,False,True,False,False,True,False,False,False,False,True,False
4,1888274,2022-06-13,5.7,389.2,False,False,True,False,False,False,True,False,False,True,False,False

In [383]:
X_validation = validation_hotencoded.drop(columns=['house_id', 'sale_date'])
X_validation_scaled = std_scalar.transform(X_validation)

In [384]:
rf = RandomForestRegressor(n_estimators=100, max_depth=10, random_state=42)
rf.fit(X_train_scaled, y_train)
y_pred = rf.predict(X_validation_scaled)
y_pred[:10]

array([ 82384.43866667, 303364.79295635, 402093.22234862, 107300.40485929,
       265379.56360803, 278943.87343987, 336563.4642352 ,  37717.73914286,
       174154.82585642, 211506.89709646])

In [385]:
base_result = pd.DataFrame({
    'house_id': validation['house_id'],
    'price': y_pred
})
base_result.head(10)

   house_id          price
0   1331375   82384.438667
1   1630115  303364.792956
2   1645745  402093.222349
3   1336775  107300.404859
4   1888274  265379.563608
5   1567679  278943.873440
6   1298770  336563.464235
7   1662892   37717.739143
8   1514321  174154.825856
9   1795371  211506.897096

# Task 5

Fit a comparison model to predict the sale price of a house.

 1. Fit your model using the data contained in “train.csv” </br></br>

 2. Use “validation.csv” to predict new values based on your model. You must return a dataframe named `compare_result`, that includes `house_id` and `price`. The price column must be your predicted values.

In [386]:
from sklearn.ensemble import GradientBoostingRegressor

In [387]:
gbr = GradientBoostingRegressor(n_estimators=100, max_depth=10, random_state=42)
gbr.fit(X_train_scaled, y_train)
y_pred = gbr.predict(X_validation_scaled)
y_pred[:10]

array([ 84556.93608476, 299433.04566185, 408918.59907574, 108505.02140676,
       272967.52717184, 279325.46647596, 345912.99510143,  35995.14898539,
       175850.76590351, 216193.42245107])

In [388]:
compare_result = pd.DataFrame({
    'house_id': validation['house_id'],
    'price': y_pred
})
compare_result.head(10)

   house_id          price
0   1331375   84556.936085
1   1630115  299433.045662
2   1645745  408918.599076
3   1336775  108505.021407
4   1888274  272967.527172
5   1567679  279325.466476
6   1298770  345912.995101
7   1662892   35995.148985
8   1514321  175850.765904
9   1795371  216193.422451